/* 2024
 * Талаев Сергей
 * Курс Android-разработчик с 0 до Middle
 * Модуль Вводный
 * Домашнее задание:
 * Установить среду разработки. Создать класс Main.
 * В классе создать метод main.
 * Вывести в консоль методом System.out.println() строку «Привет, (свое Имя)».
 */
public class Main {
    public static void main(String[] args) {

        System.out.println("Привет, Сергей!");

    }

}